#include <iostream>
#include <math.h>
#include <time.h>
using namespace std;

//   адреса + число = адреса. Операція виконується відповідно до розміру типу
//   адреса - число = адреса. Операція виконується відповідно до розміру типу
//   адреса - адреса = число, показує зміщення між адресами. Операція виконується відповідно до розміру типу
//   адреса + адреса   - не існує
int main() {

    int mas[5]={5,8,3,66,7};
    int *p1 = &mas[1]; //8
    int *p2 = &mas[3]; //66
    cout<< p2- mas<<endl;
    cout<< p1 -p2<<endl;
    cout<<mas<<endl;
    cout<<p2<<endl;
    cout<<p1<<endl;

    return 0;
}
