#include <iostream>
#include <math.h>
#include <time.h>
using namespace std;

int main() {

    //1 - звичайний покажчик/вказівники/pointer
    // зберігаємо адресу не констатного об'єкту.
    // читаємо і змінюємо об'єкт
    // зберігаємо адреси різних об'єктів
    // тип * назва;
    {
        int a =9;
        int b =19;
        int * p1;
        p1 = &a;
        cout << *p1 << endl;
        p1 = &b;
        cout << *p1 << endl;
        *p1 = 77;
        cout << b << endl;
        const int n =10;
        int const n2 =10;
       // p1 = &n; заборонено, тому що об'єкт константний
    }
    //2 - покажчик/вказівники/pointer на константу
    // зберігаємо адресу не констатного або контстантного об'єкту.
    // тільки об'єкт для читання, заборона зміни
    // зберігаємо адреси різних об'єктів
    // const тип * назва;
    // тип const * назва;
    {
        int a =9;
        int b =19;
        int const n =10;
        const int * p2;
        p2 = &a;
        cout << *p2 << endl;
        p2 = &b;
        cout << *p2 << endl;
        //*p2 = 77; заборонено змінювати об'єкт за покажчиком на константу
        p2 = &n;
        cout << *p2 << endl;
    }

    //3 - константний покажчик/вказівники/pointer
    // зберігаємо адресу не констатного об'єкту.
    // читаємо і змінюємо об'єкт
    // в момент створення вказуємо адресу об'єкту і не можемо її змінювати
    // тип * const назва = ініціалізація;
    {
        int a =9;
        int b =19;
        int const n =10;
        int * const p3 = &a;
     //   int * const p31 = &n; заборонено
        cout << *p3 << endl;
        *p3 =123;
        cout << *p3 << endl;
        //p3 = &b; заборонено
        int mas[5];
        mas[1] = 123;
        *mas = 222;
        *(mas + 2) = 333;
        int * const p32 = mas;
        *(p32 + 3) = 333;
        cout << *p32 << endl;
    }

    //4 - константний покажчик/вказівники/pointer на константу
    // const тип * const назва = ініціалізація;
    {
        int a =9;
        int b =19;
        int const n =10;
        const int * const p4 = &a;
        const int * const p41 = &n;
        cout << *p4 << endl;
        //*p3 =123; заборонено
        //p4 = &b; заборонено
    }
    return 0;
}
