#include <iostream>
#include <math.h>
#include <time.h>
using namespace std;

//   адреса + число = адреса. Операція виконується відповідно до розміру типу
//   адреса - число = адреса. Операція виконується відповідно до розміру типу
//   адреса - адреса = число, показує зміщення між адресами. Операція виконується відповідно до розміру типу
//   адреса + адреса   - не існує
int main() {

    int mas[5]={5,8,3,66,7};
    for(int i=0;i<5;i++) {
        cout<<mas+i<<"\t"<<&mas[i]<<"\t"<<mas[i]<<endl;
    }
    cout<<endl;
    for(int i=0;i<5;i++) {
        cout<<*(mas+i)<<"\t"<<mas[i]<<endl;
        // *(mas+i) <==>  mas[i]
    }



    return 0;
}
