#include <iostream>
#include <math.h>
#include <time.h>
using namespace std;

//   адреса + число = адреса. Операція виконується відповідно до розміру типу
//   адреса - число = адреса. Операція виконується відповідно до розміру типу
//   адреса - адреса = число, показує зміщення між адресами. Операція виконується відповідно до розміру типу
//   адреса + адреса   - не існує
int main() {

    int mas[5]={5,8,3,66,7};
    int *p1 = &mas[2]; //8
    cout << *p1 << endl;
    cout << p1[0] << endl;
    cout << p1[1] << endl;
    cout << p1[2] << endl;
    cout << p1[-1] << endl;
    cout << p1[-2] << endl;

    return 0;
}
